pajacobs-ghub/pic16f1769-x2-timer/x2timer_pic16f1769.c
// x2timer_pic16f1769.c
// X2/T6 trigger and timer box rebuilt around a PIC16F1769-I/P.
//
// Peter Jacobs (1) and Peter Collen (2)
// (1) School of Mechanical and Mining Engineering, University of Queensland.
// (2) Oxford Thermofluids Institute, University of Oxford
//
// 2018-01-30 start this firmware for PIC16F1778-I/SP.
// 2018-02-02 mode 1 complete with save/restore registers.
// 2019-02-19 port to PIC16F1769
// 2019-02-21 modes 3 and 4 available
// 2019-03-04 mode 5 measured-delay-using-hardware
// 2019-03-11 mode 6: mode 4, but accounts for desired distance from tube end.
// 2021-04-26 Refresh for UQ X2 use.
// 2021-05-25 Update delay calculation for X2 geometry.
//
// Build with XC8 v2.05 C90 standard 
// because the C99 project option seems to result in 
// unresolved dependencies.
// 2021-04-26 XC8 v2.31 C90 also seems to work.
// 2021-05-25 XC8 v2.32 C90 builds ok but the device header
//   comes from the pack PIC12-16F1xxx_DFP,1.2.63
// 
//
#include <xc.h>
#pragma config FOSC = INTOSC
#pragma config WDTE = OFF
#pragma config PWRTE = ON
#pragma config MCLRE = ON
#pragma config PPS1WAY = OFF
#pragma config PLLEN = ON

#include "global_defs.h"
#include "uart.h"
#include "HEFlash.h"
#include <conio.h>
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdlib.h>

const char * version_string = "Version 0.10 2021-05-25 PJ&PC";

// Some pin mappings; others are given in init_peripherals().
#define LED_ARM LATCbits.LATC6
#define LED_PWR LATCbits.LATC7

// Parameters controlling the device are stored in virtual registers.
#define NUMREG 4
int16_t vregister[NUMREG]; // working copy in SRAM

void set_registers_to_original_values()
{
    vregister[0] = 1;   // trigger mode
    vregister[1] = 5;   // trigger level 1 as a 10-bit count, 0-1023
    vregister[2] = 5;   // trigger level 2 as a 10-bit count, 0-1023
    vregister[3] = 0;   // delay as a 16-bit count
}

// High Endurance Flash block is used to hold the parameters
// when the power is off.
const char HEFdata[FLASH_ROWSIZE] __at(HEFLASH_START) = {
    1,0, 5,0, 5,0, 0,0,
    0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
    0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
    0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff
};

char save_registers_to_HEF()
{
    return HEFLASH_writeBlock(0, (void*)vregister, NUMREG*2);
}

char restore_registers_from_HEF()
{
    return HEFLASH_readBlock((void*)vregister, 0, NUMREG*2);
}

// Text buffer for incoming commands.
// They are expected to be short.
// Be careful, overruns are not handled well.
char cmd_buf[32];

void init_peripherals()
{
    // Initializing the UART sets pins RA2,RC0,RB5,RB7.
    uart1_init(38400);
    //
    // Pins RB7,RC3,RC4,RC5,RC6,RC7 are digital-outputs.
    TRISBbits.TRISB7 = 0; ANSELBbits.ANSB7 = 0; LATBbits.LATB7 = 0;
    TRISCbits.TRISC3 = 0; ANSELCbits.ANSC3 = 0; LATCbits.LATC3 = 0;
    TRISCbits.TRISC4 = 0; LATCbits.LATC4 = 0;
    TRISCbits.TRISC5 = 0; LATCbits.LATC5 = 0;
    // We also want the high-current drive enabled on RC4 and RC5.
    HIDRVC = 0b00110000;
    TRISCbits.TRISC6 = 0; ANSELCbits.ANSC6 = 0; LATCbits.LATC6 = 0; // LED_ARM
    TRISCbits.TRISC7 = 0; ANSELCbits.ANSC7 = 0; LATCbits.LATC7 = 0; // LED_PWR
    //
    // RA5 used as digital-input for arm button on box.
    // Enable its weak pull-up but disable all others.
    WPUA = 0;
    WPUB = 0;
    WPUC = 0;
    TRISAbits.TRISA5 = 1; WPUAbits.WPUA5 = 1;
    OPTION_REGbits.nWPUEN = 0;
    //
    // Fixed voltage reference to 4.096V
    FVRCONbits.ADFVR = 0b11;
    FVRCONbits.CDAFVR = 0b11;
    FVRCONbits.FVREN = 1;
    __delay_ms(10);
    //
    // We want to have analog signals on pins
    // RC1/AN5/CXIN1-, RC2/AN6/C12IN2-
    TRISCbits.TRISC1 = 1; ANSELCbits.ANSC1 = 1; WPUCbits.WPUC1 = 0;
    TRISCbits.TRISC2 = 1; ANSELCbits.ANSC2 = 1; WPUCbits.WPUC2 = 0;
    //
    // Analog to digital converter running on its own RC clock,
    // right-justified results.
    ADCON1bits.ADFM = 1; // right-justified format
    ADCON1bits.ADCS = 0b111; // FRC
    ADCON1bits.ADNREF = 0; // negative reference Vss
    ADCON1bits.ADPREF = 0b11; // positive reference FVR module
    ADCON0bits.ADON = 1;
    //
    // Digital to analog converter 1
    DAC1CON0bits.PSS = 0b10; // FVR_buffer2
    DAC1CON0bits.NSS = 0; // Vss
    DAC1CON0bits.FM = 0; // right justified format
    DAC1CON0bits.EN = 1;
    DAC1REF = (uint16_t)vregister[1];
    DACLDbits.DAC1LD = 1;
    //
    // Digital to analog converter 2
    DAC2CON0bits.PSS = 0b10; // FVR_buffer2
    DAC2CON0bits.NSS = 0; // Vss
    DAC2CON0bits.FM = 0; // right justified format
    DAC2CON0bits.EN = 1;
    DAC2REF = (uint16_t)vregister[2];
    DACLDbits.DAC2LD = 1;
    //
    // Comparator 1
    CM1NSELbits.NCH = 0b001; // C1IN1-/RC1 pin
    CM1PSELbits.PCH = 0b1010; // DAC1_output
    CM1CON0bits.POL = 1; // invert output polarity
    CM1CON0bits.ON = 1;
    //
    // Comparator 2
    CM2NSELbits.NCH = 0b010; // C2IN2-/RC2 pin
    CM2PSELbits.PCH = 0b1011; // DAC2_output
    CM2CON0bits.POL = 1; // invert output polarity
    CM2CON0bits.ON = 1;
    //
    // Configurable logic cell 3 will be set up later,
    // in the trigger_using_hardware() function.
    //
    // Flash the LEDs a moment and then settle to power-on.
    for (int8_t i=0; i < 2; ++i ) {
        LED_ARM = 1; LED_PWR = 1; __delay_ms(500);
        LED_ARM = 0; LED_PWR = 0; __delay_ms(500);
    }
    LED_PWR = 1;
}

void update_dacs(void)
{
    DAC1REF = (uint16_t)vregister[1];
    DACLDbits.DAC1LD = 1;
    DAC2REF = (uint16_t)vregister[2];
    DACLDbits.DAC2LD = 1;
}

uint16_t read_adc(uint8_t chan)
{
    ADCON0bits.CHS = chan;
    __delay_ms(10);
    ADCON0bits.GO = 1;
    NOP();
    while (ADCON0bits.GO) { NOP(); }
    return ADRES;
}

void trigger_simple_firmware(void)
{
    // Firmware-controlled trigger, both outputs immediate.
    // Use MCU to monitor and control the state of bits.
    //
    // Leave RC4 and RC5 controlled by their latch.
    LATC &= 0b11001111;
    LED_ARM = 1;
    // Wait for the comparator to go high.
    while (!CMOUTbits.MC1OUT) { CLRWDT(); }
    LATC |= 0b00110000;
    __delay_ms(500);
    LATC &= 0b11001111;
    LED_ARM = 0;
} // end trigger_simple_firmware()

