pajacobs-ghub/pic16f1769-x2-timer/x2timer_pic16f1769.c
void trigger_simple_hardware(void)
{
    // Hardware-only trigger, both outputs immediate.
    // Set up CLC3 to extend the Comparator pulse indefinitely.
    // This should be the fastest response to an event.
    //
    CLC3CONbits.EN = 0;
    CLC3CONbits.MODE = 0b100; // D flip-flop
    CLC3POLbits.POL = 0; // not inverted
    CLC3SEL0bits.D1S = 0b000111; // sync_C1OUT as data1 for 
    CLC3SEL1bits.D2S = 0; // none (CLCIN0 via PPS, but is ignored)
    CLC3SEL2bits.D3S = 0; // none
    CLC3SEL3bits.D4S = 0; // none
    // Steer the output to the MCU pins.
    GIE = 0; PPSLOCK = 0x55; PPSLOCK = 0xaa; PPSLOCKED = 0;
    RC4PPS = 0b00011; // LC3_out
    RC5PPS = 0b00011; // LC3_out also
    PPSLOCK = 0x55; PPSLOCK = 0xaa; PPSLOCKED = 1;
    //
    CLC3GLS0 = 0b10; // gate 1, send data1 through true
    CLC3GLS1 = 0; // gate 2, logic 0
    CLC3GLS2 = 0; // gate 3, logic 0
    CLC3GLS3 = 0; // gate 4, logic 0
    CLC3POLbits.G1POL = 0; 
    CLC3POLbits.G2POL = 1; // invert 0 to get logic 1
    CLC3POLbits.G3POL = 0;
    CLC3POLbits.G4POL = 0;
    CLC3CONbits.EN = 1;
    NOP();
    // At this point we have nothing to do but
    // wait for the comparator to go high.
    LED_ARM = 1;
    while (!CLCDATAbits.MCLC3OUT) { CLRWDT(); }
    __delay_ms(500);
    // End of output pulse; clean up by steering
    // the original data latch values to pins.
    GIE = 0; PPSLOCK = 0x55; PPSLOCK = 0xaa; PPSLOCKED = 0;
    RC4PPS = 0; // Return control to LATC4
    RC5PPS = 0; // Return control to LATC5
    PPSLOCK = 0x55; PPSLOCK = 0xaa; PPSLOCKED = 1;
    CLC3CONbits.EN = 0; // Disable flip-flop
    LED_ARM = 0;
} // end trigger_simple_hardware()

void trigger_delayed_firmware(void)
{
    // Trigger from comparator 1.
    // Output 1 immediate, output 2 fixed delay.
    //
    uint16_t cmp_count = (uint16_t) vregister[3];
    int nchar;
    //
    // Leave RC4 and RC5 controlled by their latch.
    LATC &= 0b11001111;
    // Set up Timer1, driven by 8MHz (FOSC/4) instruction clock.
    T1CONbits.ON = 0;
    T1CONbits.CS = 0b00;
    T1CONbits.CKPS = 0b00; // Prescale of 1.
    T1GCONbits.GE = 0; // Timer is always counting, once on.
    TMR1 = 0;
    PIR1bits.TMR1IF = 0;
    // Set up Compare module, looking at Timer1.
    CCP1CONbits.MODE = 0b1000; // Compare mode, set output on match.
    CCPR1 = cmp_count;
    PIR1bits.CCP1IF = 0;
    LED_ARM = 1;
    // Wait for comparator 1 to go high.
    while (!CMOUTbits.MC1OUT) { CLRWDT(); }
    LATC |= 0b00100000; // RC5 is immediate output.
    CCP1CONbits.EN = 1;
    T1CONbits.ON = 1;
    if (cmp_count == 0) {
        // We have no delay; proceed to signal immediately.
    } else {
        // Wait for compare match with timer.
        while (!CCP1CONbits.OUT) { CLRWDT(); }
    }
    // We have waited the appointed time.
    LATC |= 0b00010000; // RC4 is delayed output.
    //
    // Our work is done, so we now clean up at a leisurely pace.
    T1CONbits.ON = 0;
    CCP1CONbits.EN = 0;
    CCP1CONbits.MODE = 0;
    __delay_ms(500);
    LATC &= 0b11001111;
    LED_ARM = 0;    
} // end trigger_delayed_firmware()

void trigger_measured_delay(void)
{
    // Start timing on comparator 1.
    // Output 1 immediate.
    // Stop timing on comparator 2.
    // Output 2 after computed delay plus fixed delay.
    // Use MCU to monitor and control the state of bits.
    //
    uint16_t extra_delay = (uint16_t) vregister[3];
    uint16_t tmr_count, cmp_count;
    int nchar;
    //
    // Leave RC4 and RC5 controlled by their latch.
    LATC &= 0b11001111;
    // Set up Timer1, driven by 8MHz (FOSC/4) instruction clock.
    T1CONbits.ON = 0;
    T1CONbits.CS = 0b00;
    T1CONbits.CKPS = 0b00; // Prescale of 1.
    T1GCONbits.GE = 0; // Timer is always counting, once on.
    TMR1 = 0;
    PIR1bits.TMR1IF = 0;
    // Set up Compare module, looking at Timer1.
    CCP1CONbits.MODE = 0b1000; // Compare mode, set output on match.
    PIR1bits.CCP1IF = 0;
    LED_ARM = 1;
    // Wait for comparator 1 to go high, event A.
    while (!CMOUTbits.MC1OUT) { CLRWDT(); }
    T1CONbits.ON = 1;
    LATC |= 0b00100000; // RC5 is immediate output.
    // With timer counting, wait for event B.
    while (!CMOUTbits.MC2OUT) { CLRWDT(); }
    tmr_count = TMR1;
    // Leave the timer counting and set up the compare value,
    // assuming that the time to go is roughly equal to the time
    // between events A and B.
    cmp_count = tmr_count * 2 + extra_delay;
    // [TODO] Check that we don't overflow.
    // This should not be a real problem for the cases that interest us.
    // A period of 50us between events A, B should give a first count of 400.
    // Doubling that and adding a bit should be OK.
    CCPR1 = cmp_count;
    CCP1CONbits.EN = 1;
    while (!CCP1CONbits.OUT) { CLRWDT(); }
    // We have waited the appointed time.
    LATC |= 0b00010000; // RC4 is delayed output.
    //
    // Our work is done, so we now clean up at a leisurely pace.
    T1CONbits.ON = 0;
    CCP1CONbits.EN = 0;
    CCP1CONbits.MODE = 0;
    __delay_ms(500);
    LATC &= 0b11001111;
    LED_ARM = 0;
    nchar = printf("\r\ntmr_count=%d cmp_count=%d\r\n", tmr_count, cmp_count);
} // end trigger_measured_delay()

void measured_delay_using_hardware(void)
{
    // Start timing on comparator 1.
    // Output 1 immediate, to indicate gating of Timer3.
    // Stop Timer3 on comparator 2 and, simultaneously, start Timer1.
    // Output 2 (CCP1_out) after measured time plus extra delay on Timer1.
    //
    // Use core-independent peripheral devices to gate Timers
    // so that we do not have the latencies associated with 
    // MCU while loops.
    //
    uint16_t extra_delay = (uint16_t) vregister[3];
    uint16_t tmr_count, cmp_count;
    int nchar;
    //
    // Outputs RC3, RC4 and RC5 will be controlled by peripheral devices
    // for the main event but, before and after that, set to zero.
    LATC &= 0b11000111;
    //
    GIE = 0; PPSLOCK = 0x55; PPSLOCK = 0xaa; PPSLOCKED = 0;
    // Timers will be gated by pin signals.
    T1GPPS = 0b10011; // RC3
    T3GPPS = 0b10101; // RC5
    // Steer the output signals to the MCU pins.
    RC3PPS = 0b00010; // LC2_out
    RC4PPS = 0b01100; // CPP1_out
    RC5PPS = 0b00011; // LC3_out
    PPSLOCK = 0x55; PPSLOCK = 0xaa; PPSLOCKED = 1;
    //
    // Set up CLC2 to extend the Comparator 2 pulse.
    // This should be the fastest response to an event.
    CLC2CONbits.EN = 0;
    CLC2CONbits.MODE = 0b100; // D flip-flop
    CLC2POLbits.POL = 0; // not inverted
    CLC2SEL0bits.D1S = 0b001000; // sync_C2OUT as data1 for clock
    CLC2SEL1bits.D2S = 0; // none (CLCIN0 via PPS, but is ignored)
    CLC2SEL2bits.D3S = 0; // none
    CLC2SEL3bits.D4S = 0; // none
    CLC2GLS0 = 0b00000010; // gate 1, send data1-true through
    CLC2GLS1 = 0; // gate 2, logic 0
    CLC2GLS2 = 0; // gate 3, logic 0
    CLC2GLS3 = 0; // gate 4, logic 0
    CLC2POLbits.G1POL = 0; 
    CLC2POLbits.G2POL = 1; // invert logic 0 to get logic 1
    CLC2POLbits.G3POL = 0;
    CLC2POLbits.G4POL = 0;
    //
    // Set up CLC3 to extend the Comparator 1 pulse,
    // until CLC2 resets it.
    CLC3CONbits.EN = 0;
    CLC3CONbits.MODE = 0b100; // D flip-flop
    CLC3POLbits.POL = 0; // not inverted
    CLC3SEL0bits.D1S = 0b000111; // sync_C1OUT as data1 for clock
    CLC3SEL1bits.D2S = 0; // none (CLCIN0 via PPS, but is ignored)
    CLC3SEL2bits.D3S = 0b000101; // LC2_out from CLC2 as data3 for reset
    CLC3SEL3bits.D4S = 0; // none
    CLC3GLS0 = 0b00000010; // gate 1, send data1-true through
    CLC3GLS1 = 0; // gate 2, logic 0
    CLC3GLS2 = 0b00100000; // gate 3, send data3-true through
    CLC3GLS3 = 0; // gate 4, logic 0
    CLC3POLbits.G1POL = 0; 
    CLC3POLbits.G2POL = 1; // invert logic 0 to get logic 1
    CLC3POLbits.G3POL = 0;
    CLC3POLbits.G4POL = 0;
    //
    CLC2CONbits.EN = 1;
    CLC3CONbits.EN = 1;
    //
    // Set up Timer3 to record time of flight between comparators.
    T3CONbits.ON = 0;
    T3CONbits.CS = 0b00; // driven by 8MHz (FOSC/4) instruction clock.
    T3CONbits.CKPS = 0b00; // Prescale of 1.
    T3GCONbits.GE = 1; // Timer3 is gated by hardware.
    T3GCONbits.GPOL = 1; // counts while gate is high
    T3GCONbits.GTM = 0; // disable gate toggle mode
    T3GCONbits.GSPM = 0; // disable single-pulse mode
    T3GCONbits.GSS = 0b00; // look to gate pin
    TMR3 = 0;
    PIR4bits.TMR3IF = 0;
    T3CONbits.ON = 1;
    // Timer3 should now be ready to count ticks 
    // between the comparator events.
    //
    // Timer1 will set the waiting period by starting to count
    // once LC2_out goes high.
    T1CONbits.ON = 0;
    T1CONbits.CS = 0b00;
    T1CONbits.CKPS = 0b00; // Prescale of 1.
    T1GCONbits.GE = 1; // Timer1 is gated by hardware.
    T1GCONbits.GPOL = 1; // counts while gate is high
    T1GCONbits.GTM = 0; // disable gate toggle mode
    T1GCONbits.GSPM = 0; // disable single-pulse mode
    T1GCONbits.GSS = 0b00; // look to gate pin
    TMR1 = 0;
    PIR1bits.TMR1IF = 0;
    T1CONbits.ON = 1;
    //
    // Set up Compare module, looking at Timer1.
    CCP1CONbits.MODE = 0b1000; // Compare mode, set output on match.
    PIR1bits.CCP1IF = 0;
    //
    LED_ARM = 1;
    // At this point, the hardware is all set to monitor
    // the comparator signals, not much else to do but wait
    // for the time of shock to be available .
    //
    // Wait for comparator 2 (stretched by LC2_out) to go high, event B.
    while (!CLC2CONbits.OUT) { CLRWDT(); }
    tmr_count = TMR3;
    // LC2_out going high should have started Timer1 counting.
    // We should set up the compare value, assuming that 
    // the time to go is roughly equal to the time
    // between events A and B.
    cmp_count = tmr_count + extra_delay;
    // [TODO] Check that we don't overflow.
    // This should not be a real problem for the cases that interest us.
    // A period of 50us between events A, B should give a count of 400.
    CCPR1 = cmp_count;
    CCP1CONbits.EN = 1;
    while (!CCP1CONbits.OUT) { CLRWDT(); }
    //
    // At this point CCP1_out will have appeared on RC4.
    // Our work is done, so we now clean up at a leisurely pace.
    while (!CCP1CONbits.OUT) { CLRWDT(); }
    __delay_ms(500);
    // End of output pulse; clean up by steering
    // the original data latch values to pins.
    GIE = 0; PPSLOCK = 0x55; PPSLOCK = 0xaa; PPSLOCKED = 0;
    RC3PPS = 0; // Return control to LATC3
    RC4PPS = 0; // Return control to LATC4
    RC5PPS = 0; // Return control to LATC5
    PPSLOCK = 0x55; PPSLOCK = 0xaa; PPSLOCKED = 1;
    CLC3CONbits.EN = 0; // Disable flip-flop
    CLC2CONbits.EN = 0; // Disable flip-flop
    T3CONbits.ON = 0;
    T1CONbits.ON = 0;
    CCP1CONbits.EN = 0;
    CCP1CONbits.MODE = 0;
    LATC &= 0b11000111;
    LED_ARM = 0;
    nchar = printf("\r\ntmr_count=%d cmp_count=%d\r\n", tmr_count, cmp_count);
} // end measured_delay_using_hardware()


void trigger_measured_extra_delay_oxford(void)
{
    // Start timing on comparator 1.
    // Output 1 immediate.
    // Stop timing on comparator 2.
    // Output 2 after computed delay,
    // based on geometry of Oxford tube/optical system.
    // Use MCU to monitor and control the state of bits.
    //
    uint16_t tmr_count, cmp_count;
    int nchar;
    
