pajacobs-ghub/pic16f1769-x2-timer/x2timer_pic16f1769.c
    // Leave RC4 and RC5 controlled by their latch.
    LATC &= 0b11001111;
    // Set up Timer1, driven by 8MHz (FOSC/4) instruction clock.
    T1CONbits.ON = 0;
    T1CONbits.CS = 0b00;
    T1CONbits.CKPS = 0b00; // Prescale of 1.
    T1GCONbits.GE = 0; // Timer is always counting, once on.
    TMR1 = 0;
    PIR1bits.TMR1IF = 0;
    // Set up Compare module, looking at Timer1.
    CCP1CONbits.MODE = 0b1000; // Compare mode, set output on match.
    PIR1bits.CCP1IF = 0;
    LED_ARM = 1;
    // Wait for comparator 1 to go high, event A.
    while (!CMOUTbits.MC1OUT) { CLRWDT(); }
    T1CONbits.ON = 1;
    LATC |= 0b00100000; // RC5 is immediate output.
    // With timer counting, wait for event B.
    while (!CMOUTbits.MC2OUT) { CLRWDT(); }
    tmr_count = TMR1;
    // Leave the timer counting and set up the compare value,
    // assuming that centre of the optics are at about 10% of the sensor separation.
    cmp_count = (tmr_count << 1) + (tmr_count >> 3);
    
    // [TODO] Check that we don't overflow.
    // This should not be a real problem for the cases that interest us.
    // A period of 50us between events A, B should give a first count of 400.
    // Doubling that and adding a bit should be OK.
    CCPR1 = cmp_count;
    CCP1CONbits.EN = 1;
    while (!CCP1CONbits.OUT) { CLRWDT(); }
    // We have waited the appointed time.
    LATC |= 0b00010000; // RC4 is delayed output.
    //
    // Our work is done, so we now clean up at a leisurely pace.
    T1CONbits.ON = 0;
    CCP1CONbits.EN = 0;
    CCP1CONbits.MODE = 0;
    __delay_ms(500);
    LATC &= 0b11001111;
    LED_ARM = 0;
    
    nchar = printf("\r\ntmr_count=%d cmp_count=%d\r\n", tmr_count, cmp_count);
} // end trigger_measured_extra_delay_oxford()


void trigger_measured_extra_delay_x2(void)
{
    // Start timing on comparator 1.
    // Output 1 immediate.
    // Stop timing on comparator 2.
    // Output 2 after computed delay, based on geometry of X2 tube and nozzle.
    // Measure AT4-AT7 (0.568m) test-model 1.863m after AT7.
    // We want final count to be 4.28 times measured count but we settle for
    // 4.25 (4+1/4) as the scale factor.
    // Use MCU to monitor and control the state of bits.
    //
    uint16_t tmr_count, cmp_count;
    uint16_t extra_delay = (uint16_t) vregister[3];
    int nchar;
    
    // Leave RC4 and RC5 controlled by their latch.
    LATC &= 0b11001111;
    // Set up Timer1, driven by 8MHz (FOSC/4) instruction clock.
    T1CONbits.ON = 0;
    T1CONbits.CS = 0b00;
    T1CONbits.CKPS = 0b00; // Prescale of 1.
    T1GCONbits.GE = 0; // Timer is always counting, once on.
    TMR1 = 0;
    PIR1bits.TMR1IF = 0;
    // Set up Compare module, looking at Timer1.
    CCP1CONbits.MODE = 0b1000; // Compare mode, set output on match.
    PIR1bits.CCP1IF = 0;
    LED_ARM = 1;
    // Wait for comparator 1 to go high, event A.
    while (!CMOUTbits.MC1OUT) { CLRWDT(); }
    T1CONbits.ON = 1;
    LATC |= 0b00100000; // RC5 is immediate output (outA).
    LED_ARM = 0; // Indicate that the event A has happened.
    // With timer counting, wait for event B.
    while (!CMOUTbits.MC2OUT) { CLRWDT(); }
    tmr_count = TMR1;
    // Leave the timer counting and set up the compare value,
    // to be a factor of 4.25.
    cmp_count = (tmr_count << 2) + (tmr_count >> 2) + extra_delay;
    
    // [TODO] Check that we don't overflow.
    // This should not be a real problem for the cases that interest us.
    // At 9km/s, we expect a period of 63.1us between events A, B.
    // This should give a first count of 505.
    // Scaling that by 4.25 and adding a bit should be OK for a 16-bit int.
    CCPR1 = cmp_count;
    CCP1CONbits.EN = 1;
    while (!CCP1CONbits.OUT) { CLRWDT(); }
    // We have waited the appointed time.
    LATC |= 0b00010000; // RC4 is delayed output (outB).
    //
    // Our work is done, so we now clean up at a leisurely pace.
    T1CONbits.ON = 0;
    CCP1CONbits.EN = 0;
    CCP1CONbits.MODE = 0;
    __delay_ms(500);
    LATC &= 0b11001111;
    
    nchar = printf("\r\ntmr_count=%d cmp_count=%d extra_delay=%d\r\n",
                   tmr_count, cmp_count, extra_delay);
} // end trigger_measured_extra_delay_x2()


void arm_and_wait_for_event(void)
{
    int nchar;
    switch (vregister[0]) {
        case 1:
            nchar = printf("armed mode 1, simple firmware, both outputs immediate. ");
            if (CMOUTbits.MC1OUT) {
                nchar = printf("C1OUT already high. fail");
                break;
            }
            trigger_simple_firmware();
            nchar = printf("triggered. ok");
            break;
        case 2:
            nchar = printf("armed mode 2, simple hardware, both outputs immediate. ");
            if (CMOUTbits.MC1OUT) {
                nchar = printf("C1OUT already high. fail");
                break;
            }
            trigger_simple_hardware();
            nchar = printf("triggered. ok");
            break;
        case 3:
            nchar = printf("armed mode 3, one output immediate, one fixed delay. ");
            if (CMOUTbits.MC1OUT) {
                nchar = printf("C1OUT already high. fail");
                break;
            }
            trigger_delayed_firmware();
            nchar = printf("triggered. ok");
            break;
        case 4:
            nchar = printf("armed mode 4, one output immediate, one measured delay. ");
            if (CMOUTbits.MC1OUT) {
                printf("C1OUT already high. fail");
                break;
            }
            if (CMOUTbits.MC2OUT) {
                printf("C2OUT already high. fail");
                break;
            }
            trigger_measured_delay();
            nchar = printf("triggered. ok");
            break;
        case 5:
            nchar = printf("armed mode 5, measured delay using hardware. ");
            if (CMOUTbits.MC1OUT) {
                printf("C1OUT already high. fail");
                break;
            }
            if (CMOUTbits.MC2OUT) {
                printf("C2OUT already high. fail");
                break;
            }
            measured_delay_using_hardware();
            nchar = printf("triggered. ok");
            break;
		 case 6:
            nchar = printf("armed mode 6, one output immediate, one measured (Oxford optics). ");
            if (CMOUTbits.MC1OUT) {
                printf("C1OUT already high. fail");
                break;
            }
            if (CMOUTbits.MC2OUT) {
                printf("C2OUT already high. fail");
                break;
            }
            trigger_measured_extra_delay_oxford();
            nchar = printf("triggered. ok");
            break;
		 case 7:
            nchar = printf("armed mode 7, one output immediate, one measured (X2). ");
            if (CMOUTbits.MC1OUT) {
                printf("C1OUT already high. fail");
                break;
            }
            if (CMOUTbits.MC2OUT) {
                printf("C2OUT already high. fail");
                break;
            }
            trigger_measured_extra_delay_x2();
            nchar = printf("triggered. ok");
            break;
        default:
            nchar = printf("unknown mode. fail");
    }
}

void wait_for_manual_arm(void)
{
    while (1) {
        CLRWDT();
        if (!PORTAbits.RA5) {
            __delay_ms(10); // to be sure that it is not a glitch
            if (!PORTAbits.RA5) {
                arm_and_wait_for_event(); 
                break;
            }
        }
    }    
}

void interpret_command()
{
    char* token_ptr;
    const char * sep_tok = ", ";
    int nchar;
    uint8_t i, n;
    int16_t v;
    // printf("\rCommand text was: "); puts(cmd_buf);
    // printf("\r\nNumber of characters in buffer: %u", strlen(cmd_buf));
    switch (cmd_buf[0]) {
        case 'v':
            nchar = printf("%s ok", version_string);
            break;
        case 'n':
            nchar = printf("%u ok", NUMREG);
            break;
        case 'p':
            nchar = printf("\r\nRegister values:");
            for (i=0; i < NUMREG; ++i) {
                nchar = printf("\r\nreg[%d]=%d", i, vregister[i]);
            }
            nchar = printf("\r\nok");
            break;
        case 'r':
            // Report a register value.
            token_ptr = strtok(&cmd_buf[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text, assume register number.
                i = (uint8_t) atoi(token_ptr);
                if (i < NUMREG) {
                    v = vregister[i];
                    nchar = printf("%d ok", v);
                } else {
                    nchar = printf("fail");
                }
            } else {
                nchar = printf("fail");
            }
            break;
        case 's':
            // Set a register value.
            token_ptr = strtok(&cmd_buf[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text; assume register number.
                // printf("text:\"%s\"", token_ptr);
                i = (uint8_t) atoi(token_ptr);
                if (i < NUMREG) {
                    token_ptr = strtok(NULL, sep_tok);
                    if (token_ptr) {
                        // Assume text is value for register.
                        v = (int16_t) atoi(token_ptr);
                        vregister[i] = v;
                        nchar = printf("reg[%u] %d ok", i, v);
                        if (i == 1 || i == 2) { update_dacs(); }
                    } else {
                        nchar = printf("fail");
                    }
                } else {
                    nchar = printf("fail");
                }
            } else {
                nchar = printf("fail");
            }
            break;
        case 'R':
            if (restore_registers_from_HEF()) {
                nchar = printf("fail");
            } else {
                nchar = printf("ok");
            }
            break;
        case 'S':
            if (save_registers_to_HEF()) {
                nchar = printf("fail");
            } else {
                nchar = printf("ok");
            }
            break;
        case 'F':
            set_registers_to_original_values();
            nchar = printf("ok");
            break;
        case 'a':
            arm_and_wait_for_event();
            break;
        case 'm':
            nchar = printf("wait for arm button on box ");
            wait_for_manual_arm();
            break;
        case 'c':
            // Report an ADC value.
            token_ptr = strtok(&cmd_buf[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text, assume channel number.
                i = (uint8_t) atoi(token_ptr);
                if (i <= 31) {
                    v = read_adc(i);
                    nchar = printf("%d ok", v);
                } else {
                    nchar = printf("fail");
                }
            } else {
                nchar = printf("fail");
            }
            break;
        case 'h':
        case '?':
            nchar = printf("\r\nPIC16F1769-I/P X2-trigger+timer commands and registers");
            nchar = printf("\r\n");
            nchar = printf("\r\nCommands:");
            nchar = printf("\r\n h or ? print this help message");
            nchar = printf("\r\n v      report version of firmware");
            nchar = printf("\r\n n      report number of registers");
            nchar = printf("\r\n p      report register values");
            nchar = printf("\r\n r <i>  report value of register i");
            nchar = printf("\r\n s <i> <j>  set register i to value j");
            nchar = printf("\r\n R      restore register values from HEFlash");
            nchar = printf("\r\n S      save register values to HEFlash");
            nchar = printf("\r\n F      set register values to original values");
            nchar = printf("\r\n a      arm device and wait for event");
            nchar = printf("\r\n m      wait for manual arm button press");
            nchar = printf("\r\n c <i>  convert analogue channel i");
            nchar = printf("\r\n        i=30 DAC1_output");
            nchar = printf("\r\n        i=28 DAC2_output");
            nchar = printf("\r\n        i=5  RC1/AN5/C1IN1- (IN a)");
            nchar = printf("\r\n        i=6  RC2/AN6/C2IN2- (IN b)");
            nchar = printf("\r\n");
            nchar = printf("\r\nRegisters:");
            nchar = printf("\r\n 0  mode: 1= simple trigger (firmware), both outputs immediate");
            nchar = printf("\r\n          2= simple trigger (hardware), both outputs immediate");
            nchar = printf("\r\n          3= delayed trigger, output a immediate, b delayed");
            nchar = printf("\r\n          4= measured delay (firmware), output a immediate, b delayed");
            nchar = printf("\r\n          5= measured delay (hardware), output a immediate, b delayed");
            nchar = printf("\r\n          6= measured delay for Oxford tunnel, output a immediate, b delayed");
            nchar = printf("\r\n          7= measured delay for X2 tunnel, output a immediate, b delayed");
            nchar = printf("\r\n 1  trigger level a as a 10-bit count, 0-1023");
            nchar = printf("\r\n 2  trigger level b as a 10-bit count, 0-1023");
            nchar = printf("\r\n 3  (extra) delay as 16-bit count (8 ticks per us)");
            nchar = printf("\r\nok");
            break;
        default:
            nchar = printf("fail");
    } // end switch
} // end interpret_command())

int main(void)
{
    char* buf_ptr;
    int nchar;
    //
    // Initialize core, then peripherals.
    OSCCONbits.IRCF = 0b1110; // 8Mhz into 4xPLL to give FOSC=32MHz
    init_peripherals();
    //
    // Power-on values for registers.
    if (restore_registers_from_HEF()) {
        nchar = printf("Failed to restore registers from HEF.");
        set_registers_to_original_values();
    }
    update_dacs();
    //
    // Announce that the box is awake.
    nchar = printf("\r\nX2 trigger and timer, %s.", version_string);
    //
    // The basic behaviour is to be forever checking for a text command.
    nchar = printf("\r\ncmd> ");
    while (1) {
        // Characters are echoed as they are typed.
        // Backspace deleting is allowed.
        buf_ptr = gets(cmd_buf); 
        if (buf_ptr) {
            interpret_command();
            nchar = printf("\r\ncmd> ");
        }
    } // end while
    uart1_close();
    return 0;
} // end main
